app/controllers/school_classes_controller.rb

  def create
      @school_class = SchoolClass.create post_params(:title, :room_number)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-08-06 16:14:31.447535"], ["updated_at", "2019-08-06 16:14:31.447535"]]

  def update
    set_school_class
    @school_class.update post_params(:title)
---
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["updated_at", "2019-08-06 16:14:31.760780"], ["id", 1]]

def set_school_class
  @school_class = SchoolClass.find params[:id]
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]