app/controllers/students_controller.rb

    def create
        @student = Student.create post_params(:first_name, :last_name)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2019-08-06 15:51:13.418301"], ["updated_at", "2019-08-06 15:51:13.418301"]]

    def update
      set_student
      @student.update post_params(:first_name, :last_name)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-08-06 15:51:13.472525"], ["id", 1]]

    def set_student
        @student = Student.find params[:id]
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]